package lesson7;


import java.util.Arrays;
import java.util.Random;

public class Homework_6 {
    //Пользователь задает размерность двумерного массива с клавиатуры.
//Массив заполняется случайными числами от 0 до 1000.
//Необходимо создать одномерный массив, состоящий из максимальных значений
//каждого отдельного массива входящего в двумерный.
//Новый полученный массив вывести на экран.
    public static void main(String[] args) {
        int[][] arrayInt = {{123, 87, 234, 31, 92}, {925, 547, 26, 51, 94}};
        int [] arrayRez = new int[5];
        System.out.println(Arrays.deepToString(arrayInt));
        for (int[] ent : arrayInt) {
            System.out.println(Arrays.toString(ent) + " ");
            int max = ent.length;
            for (int i = 0; i < ent.length; i++) {
                boolean v = max > ent[i];
                if (v == false) {
                    max = ent[i];
                    arrayRez[i]=max;
                }
                    System.out.println(Arrays.toString(arrayRez));
                }

            }
        }
    }




            //System.out.println("Максимальное число первого массива "+max1);

            //System.out.println("Максимальное число первого массива "+max2);




















/* 2) Написати програму “стрільба по цілі”.
                  Технічні вимоги:

• Даний квадрат 5х5, де програма випадковим чином ставить ціль.
• Перед початком гри на екран виводиться текст: All Set. Get ready to rumble!.
• Сам процес гри обробляється у нескінченному циклі.
• Гравцеві пропонується ввести лінію для стрільби; програма перевіряє, щоб було введено число, і введена лінія
• знаходиться в межах ігрового поля (1-5). У випадку, якщо гравець помилився, пропонує ввести число ще раз.
• Гравцю пропонується ввести стовпчик для стрільби (має проходити аналогічну перевірку).
• Після кожного пострілу необхідно показувати оновлене ігрове поле у консолі. Клітинки, куди гравець вже стріляв, слід зазначити як *.
• Гра закінчується при попаданні в ціль. Наприкінці гри вивести в консоль фразу You have won!, а також ігрове поле.
• Уражену ціль відзначити як x.
• Завдання повинно бути виконане за допомогою масивів (НЕ використовуйте інтерфейси List, Set, Map).
Приклад виведення в консоль:

[0, 1, 2, 3, 4, 5]
[1, -, *, -, -, -]
[2, -, -, -, -, -]
[3, -, *, -, -, -]
[4, -, -, *, -, -]
[5, -, *, -, -, *]

 */